# Задача 7. Проверить истиность утверждения ¬(X ⋁ Y ⋁ Z) = ¬X ⋀ ¬Y ⋀ ¬Z для всех значений предиката.

rezult = "Утверждение ИСТИНА"
for i in range(1):           # Во второй лекции дисциплины "Математика и информатика для программистов" 
    for j in range(1):       # показывали составление таблиц, где был перебор вариантов от 0 до 1 (значения предиката)"
        for w in range(1):   # из чего можно сделать вывод, что требуется перебор 
            if not (i or j or w) != (not (i) and not (j) and not (w)):
                rezult = "Утверждение ЛОЖНО"
                break
print (rezult)
