# Задача 1. апишите программу, которая принимает на вход два числа и проверяет, является ли одно число
# квадратом другого. Примеры:
#                             5, 25 -> да
#                             4, 16 -> да
#                             25, 5 -> да
#                             8,9 -> нет
# РЕШЕНИЕ ЗАДАЧИ 1:
# 
x = int(input('Здравствуйте!\nВведите Ваше любимое число:\n'))
y = int(input('Введите Ваше НЕ любимое число:\n'))
# 1 вариант
# if(x*x==y or y*y==x):
#     print(f'{x}, {y}','-->','ДА!')
# else:
#     print(f'{x}, {y}','-->','НЕТ!')
if x == y*y: # x == y**2
    print(f'ДА! Число {x} является квадратом числа {y}')
    print(f'{x},{y} => ДА')
elif y == x*x: # y == x**2
    print(f'ДА! Число {y} является квадратом числа {x}')
    print(f'{y} и {x} => ДА')
else:
    print(f'{y} и {x} => НЕТ')


