# Задача 28. Найдите корни квадратного уравнения Ax² + Bx + C = 0 двумя способами:
#     1) с помощью математических формул нахождения корней квадратного уравнения
#     2) с помощью дополнительных библиотек Python

def Math(A, B, C):
    Dis = B**2-4*A*C
    print(f'Дискриминант = {Dis}, значит:')
    if Dis > 0:
        x_1 = round(float((-B+Dis ** 0.5)/2*A), 4)  # Добавить math.sqrt
        x_2 = round(float((-B-Dis ** 0.5)/2*A), 4)
        print(
            f'Данное уравнение имеет два корня:\n1 корень: {x_1}\n2 корень: {x_2}')
    elif Dis == 0:
        x = (-B)/2*A
        print(f'Данное уравнение имеет один корень, который равен: {x}')
    elif Dis < 0:
        print('К сожалению такое уравнение НЕ ИМЕЕТ корней! Увы!')


x = int(input('Введите коэфициент "A" и нажмите "Enter":\n'))
y = int(input('Введите коэфициент "B" и нажмите "Enter":\n'))
z = int(input('Введите значение свободного члена "C" и нажмите "Enter":\n'))
print(f'Ваше квадратное уравнение имеет вид:\n{x}*x^2+{y}*x+{z}')
Math(x, y, z)