# Задача 11. Напишите программу, которая принимает на вход число N и выдаёт последовательность из N членов.
# Пример:
# Для N = 5: 1, -3, 9, -27, 81
N = int(input('Введите Ваше любимое число: '))
print(f'Для N = {N}: ', end='')
for i in range(N):
    if i == N-1:              # if and else чтобы не было последней запятой
        print(f'{(-3)**i}')
    else:
        print(f'{(-3)**i}, ', end='')
