# Задача 6. На столе стоит две корзины с яблоками. Корзина a и корзина b. Введите количество яблок с 
# клавиатуры. Затем поменяйте содержимое корзин местами и выведите результат. 
# Например, если пользователь ввёл 5 и 7, то до обмена a=5, b=7, а после a=7 и b=5.
# 1 вариант
Korzina_1 = int(input('Введите количество яблок в ПЕРВОЙ корзине: \n'))
Korzina_2 = int(input('Введите количество яблок во ВТОРОЙ корзине: \n'))
Korzina_3 = Korzina_1
Korzina_1 = Korzina_2
Korzina_2 = Korzina_3
print(f'Итак до обмена было в:\nПЕРВОЙ КОРЗИНЕ = {Korzina_3} яблок \nВТОРОЙ КОРЗИНЕ = {Korzina_1} яблок')
print(f'А теперь в:\nПЕРВОЙ КОРЗИНЕ = {Korzina_1} яблок \nВТОРОЙ КОРЗИНЕ = {Korzina_2} яблок')
# 2 вариант
# Korzina_1 = int(input('Введите количество яблок в ПЕРВОЙ корзине: \n'))
# Korzina_2 = int(input('Введите количество яблок во ВТОРОЙ корзине: \n'))
# print(f'Итак до обмена было в:\nПЕРВОЙ КОРЗИНЕ = {Korzina_1} яблок \nВТОРОЙ КОРЗИНЕ = {Korzina_2} яблок')
# print(f'А теперь в:\nПЕРВОЙ КОРЗИНЕ = {Korzina_2} яблок \nВТОРОЙ КОРЗИНЕ = {Korzina_1} яблок')