# Задача 8.  Напишите программу, которая принимает на вход координаты точки (X и Y), и выдаёт номер четверти
# плоскости, в которой находится эта точка (или на какой оси она находится).
# Пример:
# x=34; y=-30 -> 4
# x=2; y=4-> 1
# x=-34; y=-30 -> 3
# 1 вариант
print('Приветсвую, мой дорогой друг! Сейчас начнется магия, не прибегая к гаданию на кофе, узнаем в какой четверти плоскости находится точка.')
print('Заинтриговал? Давай тогда начнем!')
x = int(input('Укажи, координату по оси X = '))
y = int(input('Укажи, координату по оси Y = '))
if x > 0 and y > 0:
    print(f'x = {x}; y = {y} -> 1')
    print('Твоя точка лежит в I-ой четверти координатной плоскости!')
elif x > 0 and y < 0:
    print(f'x = {x}; y = {y} -> 4')
    print('Твоя точка лежит в IV-ой четверти координатной плоскости!')
elif x < 0 and y < 0:
    print(f'x = {x}; y = {y} -> 3')
    print('Твоя точка лежит в III-ей четверти координатной плоскости!')
else:
    print(f'x = {x}; y = {y} -> 2')
    print('Твоя точка лежит во II-ой четверти координатной плоскости!')


# 2 вариант (отличие вместо else -> elif)
# x = int(input('Введите координаты точки X: '))
# y = int(input('Введите координаты точки Y: '))
# if x > 0 and y > 0:
#     print(f'x={x}, y={y} -> 1')
# elif x < 0 and y > 0:
#     print(f'x={x}, y={y} -> 2')
# elif x < 0 and y < 0:
#     print(f'x={x}, y={y} -> 3')
# elif x > 0 and y < 0:
#     print(f'x={x}, y={y} -> 4')