# Задайте список. Напишите программу, которая определит, присутствует ли в заданном списке
# строк некое число.

# Spisok = [56, 'Привет', 4, 20, 78]
# x = int(input ('Введите искомое значение: '))
# if x in Spisok:
#     print (f'Да значение {x}, в списке присутсвует! УРА!')
# else:
#     print ('К сожалению такого значения не существует!')

#  2 вариант. Проверяет не только нахождения числа в списке, но и проверяет содержит ли элемент списка заданное число

def Var_2_Poisk (Spisok, x):     
    count = 0
    for i in Spisok:
        if i == x:
            count = 1
        if x in i:
            count = 1
    if count == 1:
        print (f'Да значение {x}, в списке присутсвует! УРА!')
    else:
        print (f'К сожалению, в списке отсутсвует число {x}')
Vash_Spisok = list(input('Введите Ваш список через пробел\n').split(' '))
Chislo = str(input('Введите число для проверки его присутсвия в списке\n'))
Var_2_Poisk (Vash_Spisok, Chislo)