# Задача 3. Вывести на экран числа от -N до N. Напишите программу, которая будет на вход принимать число 
# N и выводить числа от -N до N.
# Примеры:
# 5 -> -5, -4, -3, -2, -1, 0, 1, 2, 3, 4, 5
N = int(input('Введите Ваше любимое число:\n'))
# x = []                                   # можно числа вывести списком, тогда в тело цикла for добавить x.append (i) и после выхода из цикла print (x)
print(f'{N} => ', end='')
for i in range(-N, N+1):
    if i != N:
        print(f'{i}, ', end='')
    else:
        print(i)