# Задача 32. Дана последовательность чисел. Получить список неповторяющихся
# элементов исходной последовательности.
# Пример:
# [1, 2, 3, 5, 1, 5, 3, 10] => [1, 2, 3, 5, 10]
def SpisokNoPovtor(x):
    y = []
    for i in x:
        if i not in y:
            y.append(i)
    return y


Vibor = int(input('Здравствуйте, уважаемый проверяющий! Как бы Вы хотели проверить выполнение задания?\nЕсли хотите использовать список из примера, то нажмите 1 и Enter, если жедаете ввести свой список, то нажмите 2 и Enter!\nИтак:\n1 - Список из примера\n2 - Ввести самому список\n'))
if Vibor == 1:
    Spisok = [1, 2, 3, 5, 1, 5, 3, 10]
    print(f'{Spisok} => {SpisokNoPovtor(Spisok)}')
elif Vibor == 2:
    Spisok_vvod = list(
        map(int, input('Введите Ваши любимые числа через пробел:\n').split()))
    print(f'{Spisok_vvod} => {SpisokNoPovtor(Spisok_vvod)}')
else:
    print('Данным решением предусмотренно только два варианта! Приносим свои извенения!')