# Задача 0. Написать текст "Привет мир" вобратном пордяке.
# РЕШЕНИЕ ЗАДАЧИ 0:

text = 'Привет мир!'
print (text[::-1])