# Задайте список. Напишите программу, которая определит, присутствует ли в заданном списке
# строк некое число.

Spisok = [56, 'Привет', 4, 20, 78]
x = int(input ('Введите искомое значение: '))
if x in Spisok:
    print (f'Да значение {x}, в списке присутсвует! УРА!')
else:
    print ('К сожалению такого значения не существует!')