# Задача 2. Найти максимальное из пяти чисел.Напишите программу, которая на вход 
#           принимает 5 чисел и находит максимальное из них.
# Пример:
# 1, 4, 8, 7, 5 -> 8
# 78, 55, 36, 90, 2 -> 90

a = []
for element in input('Введите пять целых чисел, через запятую: \n').split (','): # можно через пробел тогда ....split ():
    a.append(int(element))
max = a[0]
for i in range(len(a)):
    if a[i] > max:
        max = a[i]
print(f'{a} -> {max}')
print(f'Максимальное число = {max}')