# Задача 7 (семинар). Пишем "компьютерный вирус". Запросите у пользователя любой текст. Сохраните вторую с начала и третью
# с конца буквы в отдельные переменные (например a и b). Замените во всём тексте букву из переменной a,
# на букву из переменной b и выведите зашифрованный текст на экран.
# Пример до шифровки: "Однажды, в студеную зимнюю пору, я из лесу вышел; был сильный мороз".
# Пример после шифровки: "Орнажры, в стуреную зимнюю пору, я из лесу вышел; был сильный мороз".

text = str(input('Введите ниже Ваш текст:\n'))
a = text[1]
b = text[(len(text)-1)-2]
print (f'Итак, что было до шифровки:\n {text}')
print (f'В вот, что стало после шифровки:')
print (text.replace(a,b))