# Задание 12. Для натурального n создать словарь индекс-значение, состоящие из
# элементов последовательности 3n+1
# Пример:
# Для n = 6: {1: 4, 2: 7, 3: 10, 4: 13, 5: 16, 6: 19}
def Slovar(x):
    dictionary = {}
    for i in range(1, x+1):
        dictionary[i] = 3*i+1
    print(dictionary)
n = int(input('Введите целое положительно число: '))
if n < 0:
    print('Надо было ввести ПОЛОЖИТЕЛЬНОЕ цисло!!')
if n != int(n):
    print('Надо было ввести ЦЕЛОЕ цисло!!')
print(f'Для n = {n}: ', end='')
Slovar(n)