# Задача 8 (Семинар). Напишите программу, которая проверит истинность утверждения ¬(X ⋁ Y) = ¬X ⋀ ¬Y
rezult = "Утверждение ИСТИНА"
for i in range(1):           # Во второй лекции дисциплины "Математика и информатика для программистов" 
    for j in range(1):       # показывали составление таблиц, где был перебор вариантов от 0 до 1 (значения предиката)"
        if not (i or j) != (not (i) and not (j)):  # из чего можно сделать вывод, что требуется перебор
                rezult = "Утверждение ЛОЖНО"
                break             
print (rezult)