# Задача 27. Задайте строку из набора чисел. Напишите программу, которая покажет большее и меньшее число. 
# В качестве символа-разделителя используйте пробел.
def BigLittle(x):
    max = x[0]
    min = x[0]
    for i in x:
        if max < i:
            max = i
        if min > i:
            min = i
    print (f'Самое большое число -> {max}\nСамое маленькое число -> {min}')

Vibor_Stroki = int(input(
    'Здравствуйте! Уважаемый проверяющий, как будет Вам удобно проверить решение?\nЕсли хотите задать строку чисел самостоятельно, то введите "1" и нажмите "Enter",\nесли хотите считать строку чисел из файла Task_27.txt, то введите "2" и нажмите "Enter"?\nИтак: \n1 - самому ввести строку чисел\n2 - считать из файла\n'))
if Vibor_Stroki == 1:
    Nabor = list(map(int,input('Введите Ваши любимые числа, через пробел\n').split(' ')))
elif Vibor_Stroki == 2:
    Spisok = 'Task_27.txt'
    data = open(Spisok, 'r')
    Nabor = list(map(int, data.read().split()))
else:
    print ('К сожалению данной программой предусмотрено только 2 варианта. Попробуйте ещё!!!')
print(f'Итак, был получен список: {Nabor}, в этом списке:')
BigLittle(Nabor)