# Задача 9. Напишите программу, которая по заданному номеру четверти, показывает диапазон возможных координат
# точек в этой четверти (x и y).
Chetvert = int(input('Введите номер чертверти: '))
if Chetvert==1:
    print (f'В четверти {Chetvert} точки могут принимать значения: X(0;+oo), Y(0;+oo)')
elif Chetvert==2:
    print (f'В четверти {Chetvert} точки могут принимать значения: X(0;-oo), Y(0;+oo)')
elif Chetvert==3:
    print (f'В четверти {Chetvert} точки могут принимать значения: X(0;-oo), Y(0;-oo)')
elif Chetvert==4:
    print (f'В четверти {Chetvert} точки могут принимать значения:  X(0;+oo), Y(0;-oo)')
else:
    print (f'Пока известно только о 4-х четвертях. Начните заново и введите цифру в диапозоне от 1 до 4!')