# Задача 10 (Семинар).Задайте список из целых и вещественных чисел. Отсортируйте его по возрастанию, от меньшего
# к большему и выведите в консоль. Зеркально разверните его и выведите на строке ниже.
# Пример:
# список -> [1,0.5,15,3.4] Сортировка - > [0.5,1,3.4,15]
# Разворот - > [15,3.4,1,0.5]
# list = [1, 0.5, 15, 3.4]
# print(f'Список: {list}')
# print(f'После сортировки: {sorted(list)}')
# list2 = sorted(list)
# print(f'Зеркальное отражение (разворот): {list2[::-1]}')

# 2 вариант:
spisok = [1,0.5,15,3.4]
print(f'Список: {spisok}')
spisok.sort()
print(f'После сортировки: {spisok}')
print(f'Зеркальное отражение (разворот): {spisok[::-1]}')